{
  "categorias": [
    {
      "titulo": "Filmes da DC",
      "link": "https://www.alura.com.br/formacao-front-end",
      "cor": "#0c3578",
      "text":"Universo Extendido DC",

      "videos": [
        {
          "titulo": "Mulher-Maravilha",
          "url": "https://www.youtube.com/watch?v=tqfOtQ5auBA",
          "descricao":"Treinada desde cedo para ser uma guerreira imbatível, Diana Prince nunca saiu da paradisíaca ilha em que é reconhecida como princesa das Amazonas. "
        },
        {
          "titulo": "Mulher-Maravilha",
          "url": "https://www.youtube.com/watch?v=tqfOtQ5auBA",
          "descricao":"Treinada desde cedo para ser uma guerreira imbatível, Diana Prince nunca saiu da paradisíaca ilha em que é reconhecida como princesa das Amazonas. "
          
        },
        {
          "titulo": " O Homem de Aço",
          "url": "https://www.youtube.com/watch?v=Bgi8Ud7IJJ4",
          "descricao":"Com a iminente destruição de Krypton, seu planeta natal, Jor-El e sua mulher procuram preservar a raça enviando o filho recém-nascido para a Terra. A nave espacial da criança aterrissa na fazenda de Jonathan e Martha Kent, que o batizam de Clark e o criam como seu próprio filho."
        },
        {
          "titulo": "Batman vs Superman: A Origem da Justiça",
          "url": "https://www.youtube.com/watch?v=IHDgrNxO-5I",
          "descricao":"O confronto entre Superman e Zod em Metrópolis fez a população mundial se dividir sobre a presença de extraterrestres na Terra. Enquanto muitos consideram Superman um novo deus, há aqueles que entendem ser extremamente perigosa a existência de um ser tão poderoso sem qualquer tipo de controle."
        },
        {
          "titulo": "Esquadrão Suicida",
          "url": "https://www.youtube.com/watch?v=8pYp4T8TdP4",
          "descricao":"Um time dos mais perigosos e encarcerados supervilões são contratados por uma agência secreta do governo, para combater uma poderosa entidade. No entanto, quando eles percebem que não foram escolhidos apenas para ter sucesso, mas também por sua óbvia culpa quando inevitavelmente falharem, terão que decidir se vale a pena ou não continuar correndo risco de morte."
        },
        {
          "titulo": "Liga da Justiça",
          "url": "https://www.youtube.com/watch?v=H0Z7ewOXCKw",
          "descricao":"Impulsionado pela restauração de sua fé na humanidade e inspirado pelo ato altruísta do Superman, Bruce Wayne convoca sua nova aliada Diana Prince para o combate contra um inimigo ainda maior, recém-despertado."
        },
        {
          "titulo": "Aquaman",
          "url": "https://www.youtube.com/watch?v=WDkg3h8PCVU",
          "descricao":"A cidade de Atlantis, que já foi lar de uma das mais avançadas civilizações do mundo, agora é um reino submerso dominado pelo ganancioso Rei Orm."
        },
        {
          "titulo": "Shazam",
          "url": "https://www.youtube.com/watch?v=SJjg4ZTkCzk",
          "descricao":"Billy Batson tem apenas 14 anos de idade, mas recebeu de um antigo mago o dom de se transformar em um super-herói adulto chamado Shazam. "
        },
        {
          "titulo": "Aves de Rapina",
          "url": "https://www.youtube.com/watch?v=M2LMRXkAZSY",
          "descricao":"Depois de se aventurar com o Coringa, Arlequina se junta a Canário Negro, Caçadora e Renee Montoya para salvar a vida de uma garotinha do criminoso Máscara Negra em Gotham City."
        }        
      ]
    },
    {
      "titulo": "Mais da DC",
      "cor": "#3c0757",
      "text":"filmes que não fazem parte do universo da DC",
      "videos": [
        {
          "titulo": "Batman Begins",
          "url": "https://www.youtube.com/watch?v=qHhHIbNuok8",
          "descricao":"O jovem Bruce Wayne viaja para o Extremo Oriente, onde recebe treinamento em artes marciais do mestre Henri Ducard, um membro da misteriosa Liga das Sombras."
        },
        {
          "titulo": "Batman - O Cavaleiro das Trevas",
          "url": "https://www.youtube.com/watch?v=EXeTwQWrcwY",
          "descricao":"Com a ajuda de Jim Gordon e Harvey Dent, Batman tem mantido a ordem na cidade de Gotham. Mas um jovem e anárquico criminoso conhecido como Coringa ganha força e decide instaurar um verdadeiro caos na cidade."
        },
        {
          "titulo": "Batman - O Cavaleiro das Trevas Ressurge",
          "url": "https://www.youtube.com/watch?v=q8ncjHylG6c",
          "descricao":"Após ser culpado pela morte de Harvey Dent e passar de herói a vilão, Batman desaparece. As coisas mudam com a chegada de uma ladra misteriosa, a Mulher-Gato, e Bane, um terrorista mascarado, que fazem Batman abandonar seu exílio forçado."
        },
        {
          "titulo": "Watchmen",
          "url": "https://www.youtube.com/watch?v=wglmbroElU0",
          "descricao":"Um de seus antigos colegas é assassinado, e o vigilante mascarado Rorschach decide investigar um plano para matar e desacreditar todos os super-heróis do passado e do presente."
        }, 
        {
          "titulo": "Lanterna Verde",
          "url": "https://www.youtube.com/watch?v=_axLoYlwwmU",
          "descricao":"Hal Jordan, um vaidoso piloto de testes, recebe um poderoso anel e é recrutado por um esquadrão intergaláctico chamado Lanterna Verde para lutar contra um feroz inimigo que ameaça acabar com o equilíbrio do universo."
        }, 
        {
          "titulo": "Superman - O Retorno",
          "url": "https://www.youtube.com/watch?v=bRqAUqAFhNw",
          "descricao":"O Superman volta à Terra depois de cinco anos passados no planeta Krypton, precisando reconquistar o amor de Lois Lane e descobre que o novo plano de Lex Luthor pode ameaçar a vida de bilhões de pessoas."
        }
      ]
    },
    {
      "titulo": "Series da DC",
      "cor": "#074457",
      "text":"",
      "videos": [
        {
          "titulo": "The Flash",
          "url": "https://www.youtube.com/watch?v=Yj0l7iGKh8g",
          "descricao":"Acompanhe as aventuras do homem mais veloz do planeta, o cientista da Central City Police Barry Allen, que após um trágico acidente adquire o poder da velocidade."
        },
        {
          "titulo": "Arrow",
          "url": "https://www.youtube.com/watch?v=-Ar8hbGDzuc",
          "descricao":"Após um violento naufrágio, o playboy milionário Oliver Queen é dado como morto. Cinco anos depois, é resgatado de uma ilha do Pacífico e enviado de volta para Starling City, onde passa a agir como vigilante secreto."
        },
        {
          "titulo": "Supergirl",
          "url": "https://www.youtube.com/watch?v=49RZx5tUKM4",
          "descricao":"Kara Zor-El escapou de seu planeta quando tinha 12 anos de idade. Desde que chegou à Terra, ela conseguiu esconder seus poderes, os quais compartilha com seu primo, o Super-Homem."
        },
        {
          "titulo": "Legends of Tomorrow",
          "url": "https://www.youtube.com/watch?v=fdoi9uyEFPM",
          "descricao":"Após ter visto o futuro, o viajante do tempo Rip Hunter recebe a missão de montar um grupo eclético de heróis e vilões para confrontar uma ameaça invencível - uma que não somente põe em risco o planeta, mas também o tempo."
        },
        {
          "titulo": "Batwoman",
          "url": "https://www.youtube.com/watch?v=XZoLzXIunPM",
          "descricao":"Kate Kane segue os passos de seu primo desaparecido, Bruce Wayne, e protege as ruas de Gotham City como Batwoman."
        },
        {
          "titulo": "Titans",
          "url": "https://www.youtube.com/watch?v=iH44Z0QwrWQ",
          "descricao":"Titans é uma série de televisão americana criada por Akiva Goldsman, Geoff Johns e Greg Berlanti para a DC Universe. Baseado na equipe Novos Titãs, da DC Comics, a série mostra um grupo de jovens heróis que unem suas forças na luta contra o mal."
        },
        {
          "titulo": "Raio Negro",
          "url": "https://www.youtube.com/watch?v=3LAUGA01mUc",
          "descricao":"Black Lightning é uma série de televisão americana desenvolvida por Salim Akil. É baseada no personagem Raio Negro, da DC Comics. A série é ambientado no Universo Arrow, o universo compartilhado da DC Comics na TV da The CW."
        },
        {
          "titulo": "Patrulha do Destino",
          "url": "https://www.youtube.com/watch?v=6tTM9nbRk5A",
          "descricao":"Parte grupo de apoio e parte equipe de super-heróis, a Patrulha do Destino é uma turma de desajustados que adquiriu superpoderes e luta para salvar um mundo que não quer ter nada a ver com eles."
        }
      ]
    },
    {
      "titulo": "Animação da DC",
      "cor": "#570723",
      "text":"Universo de filmes animados da DC Comics",
      "videos": [
        {
          "titulo": "Liga da Justiça: Ponto de Ignição ",
          "url": "https://www.youtube.com/watch?v=2_uZn7mxnts",
          "descricao":"Barry Allen acorda em uma linha do tempo alternativa, mais tarde conhecida como Flashpoint, onde ele não é o Flash e conhece Thomas Wayne, que é o Batman da linha do tempo. Enquanto ele trabalha para restaurar sua antiga linha do tempo, Barry também deve lutar com o Professor Zoom, que parece estar por trás de tudo."
        },
        {
          "titulo": "Liga da Justiça Guerra",
          "url": "https://www.youtube.com/watch?v=q3F9ASSsHUk",
          "descricao":"Durante uma investigação em Gotham City,Batman encontra Lanterna Verde que, juntos, descobrem uma Caixa Mãe que pede a Superman para atacar a dupla. Mais tarde, eles encontram Mulher Maravilha,  Flash, Cyborg e Shazam para se unir e enfrentar a ameaça de Darkseid"
        },
        {
          "titulo": "O Filho do Batman",
          "url": "https://www.youtube.com/watch?v=68QW02BAu78",
          "descricao":"O filme mostra Batman conhecendo o seu filho Damian Wayne, e enquanto ele tenta se relacionar com ele, os dois tem que juntos enfrentar o Exterminador, que quer matar Damian e assumir o lugar de Ra's Al Ghul na Liga dos Assassinos."
        },
        {
          "titulo": "Liga da Justiça: O Trono de Atlântida",
          "url": "https://www.youtube.com/watch?v=donPLB1xaBw",
          "descricao":"Quando os guerreiros atlantes atacam uma tripulação submarina, Arthur Curry / Aquaman deve se unir à Liga da Justiça para impedir seu irmão, Orm Marius / Mestre do oceano, responsável pelo ataque, e que também planeja roubar o trono de Atlântida para si mesmo, a fim de causar um guerra contra a superfície."
        },
        {
          "titulo": "Batman vs Robin",
          "url": "https://www.youtube.com/watch?v=RzM835MUcaU",
          "descricao":"Sequência de O Filho do Batman, Batman vs Robin foi lançado em 7 de abril de 2015 e traz a Corte das Corujas como os vilões. Na trama Damian conhece o Garra, um serviçal da organização conhecida como Corte das Corujas cujo modus operandi é semelhante ao da Liga dos Assassinos, o que faz com que Damian se deixa levar pela influência do Garra. Tal atitude faz Damian entrar em conflito com seu pai."
        },
        {
          "titulo": "Batman: Sangue Ruim",
          "url": "https://www.youtube.com/watch?v=honMCo_2HqE",
          "descricao":"Sequência de Batman vs Robin, Batman: Sangue Ruim foi lançado em 20 de janeiro de 2016 e apresenta uma história original. Na trama, após Bruce Wayne desaparecer, Dick Grayson, o Asa Noturna, decide se tornar o Batman temporariamente. Ele, Damian e os novos aliados Batwoman e Batwing irão se unir para deter uma nova ameaça que está surgindo e salvar Bruce."
        },
        {
          "titulo": "Liga da Justiça vs Jovens Titãs",
          "url": "https://www.youtube.com/watch?v=dFjg3oNxaJ4",
          "descricao":"Após fracassar em uma missão com a Liga da Justiça, Damian é enviado para os Jovens Titãs para aprender a como a trabalhar em equipe. Enquanto ele é treinado pelo grupo, o demônio Trigon domina a Liga da Justiça e pretende dominar o mundo também, e agora a única esperança são os Jovens Titãs."
        },
        {
          "titulo": "Liga da Justiça Sombria ",
          "url": "https://www.youtube.com/watch?v=H1kzDHnUvAQ",
          "descricao":"A trama mostra Batman reunindo John Constantine, Zatanna e Desafiador para juntos deterem uma invasão sobrenatural."
        },
        {
          "titulo": "Jovens Titãs: O Contrato de Judas",
          "url": "https://www.youtube.com/watch?v=GIeoysdR8AQ",
          "descricao":"Os Titãs ganham um novo membro da equipe, Terra, que parece ter segundas intenções ao enfrentar o mercenário, Slade Wilson / Exterminador, e um culto terrorista liderado pelo Irmão Sangue."
        },
        {
          "titulo": "Esquadrão Suicida: Acerto de Contas ",
          "url": "https://www.youtube.com/watch?v=qgtlBTI60E8",
          "descricao":"Após descobrir que irá morrer, Amanda Waller envia o Esquadrão Suicida em uma missão para obter um artefato que irá salvar a vida dela, mas enquanto o Esquadrão está em busca desse artefato, Vandal Savage e Eobard Thawne também estão."
        },
        {
          "titulo": "A Morte do Superman",
          "url": "https://www.youtube.com/watch?v=J5aMJ1qMgA8",
          "descricao":"Um asteroide atravessa a atmosfera e cai no oceano trazendo com ele uma força imbatível chamada Apocalipse. Com vidas inocentes ameaçadas e Metropolis sob ataque, Batman e Mulher-Maravilha correm para enfrentar essa ameaça."
        },
        {
          "titulo": "Constantine: Cidade dos Demônios",
          "url": "https://www.youtube.com/watch?v=Tgujmtdj_3c",
          "descricao":"Quando Trish entra em um misterioso coma com indícios de magia negra, Chas recorre a John Constantine, que interrompe sua rotina de ressacas para ajudar a salvar a alma da filha seu grande amigo. "
        },
        {
          "titulo": "Reinado do Superman ",
          "url": "https://www.youtube.com/watch?v=HlC7veaQizk",
          "descricao":"O mundo lamenta a morte do Homem de Aço e, enquanto isso, surgem novos heróis, cada um alegando ser o verdadeiro Superman renascido. Os poderes de todos são testados quando uma ameaça mortal atinge a Terra."
        },
        {
          "titulo": "Batman: Silêncio ",
          "url": "https://www.youtube.com/watch?v=PvxlpQTfArM",
          "descricao":"O passado de Batman começa a se desenrolar e se inicia uma corrida para o Cavaleiro das Trevas solucionar os jogos mortais do silêncio."
        },
        {
          "titulo": "Mulher Maravilha: Linhagem de Sangue",
          "url": "https://www.youtube.com/watch?v=PPcd_cAwLl0",
          "descricao":"Ela assume a missão de ajudar uma jovem garota problemática que foi recrutada por uma organização mortal conhecida como Corporação Vilania, cujos membros criminosos almejam invadir Themyscira, o lar paradisíaco de nossa heroína. A batalha será épica, porque se há uma coisa que as Amazonas conhecem bem é a guerra!"
        },
        {
          "titulo": "Liga da Justiça Sombria: A Guerra de Apokolips",
          "url": "https://www.youtube.com/watch?v=F6FdamDMbW0",
          "descricao":"A Liga da Justiça sempre foi a primeira e última defesa da Terra, mas, com a chegada iminente de Darkseid, tudo está para mudar. Após a destruição da Terra, o grupo se reune para derrubar o tirano e salvar os membros remanescentes da equipe."
        }
      ]
    },
    {
      "titulo": "X-MEN",
      "cor": "#616161",
      "text":"Filmes dos X-MEN",

      "videos": [
        {
          "titulo": "X-Men: O Filme",
          "url": "https://www.youtube.com/watch?v=VNxwlx6etXI",
          "descricao":"Eles são filhos do átomo superior, o próximo elo na corrente da evolução. Cada um nasceu com uma mutação genética rara, que na puberdade se manifestou em poderes extraordinários."
        },
        {
          "titulo": "X-Men 2",
          "url": "https://www.youtube.com/watch?v=luHcOYS1HxQ",
          "descricao":"Stryker, um ex-comandante perverso do exército, tem a chave para o passado de Wolverine e o futuro dos X-Men. Esta ameaça reacende a chamada para um ato de registro mutante. "
        },
        {
          "titulo": "X-Men: O Confronto Final",
          "url": "https://www.youtube.com/watch?v=YlCEtoMusjY",
          "descricao":"A descoberta de uma cura para as mutações leva os mutantes a um ponto decisivo. Eles podem escolher entre abandonar seus poderes e se tornarem humanos ou continuar com os poderes e permanecerem excluídos. "
        },
        {
          "titulo": "X-Men: Primeira Classe",
          "url": "https://www.youtube.com/watch?v=kyQKi5-k0UU",
          "descricao":"No início dos anos 1960, durante o auge da Guerra Fria, um mutante chamado Charles Xavier conhece um mutante chamado Erik Lehnsherr."
        },
        {
          "titulo": "X-Men: Dias de um Futuro Esquecido",
          "url": "https://www.youtube.com/watch?v=I0qeADYfl4k",
          "descricao":"Convencido de que os mutantes são uma ameaça para a humanidade, o Dr. Bolivar Trask desenvolve os Sentinelas, gigantescos robôs, que os perseguem impiedosamente."
        },
        {
          "titulo": "X-Men: Apocalypse",
          "url": "https://www.youtube.com/watch?v=3vYpPwBKJ28",
          "descricao":"O primeiro mutante destruidor do mundo, Apocalipse, está de volta disposto a acabar com a humanidade. Professor Xavier conta com Mística, Fera e Mercúrio, além de novos alunos, para impedir o vilão."
        },
        {
          "titulo": "X-Men: Fênix Negra",
          "url": "https://www.youtube.com/watch?v=xrbBVIpssDQ",
          "descricao":"Jean Grey começa a desenvolver incríveis poderes que a corrompem e a transformam em uma Fênix Negra. Agora, os X-Men precisam decidir se a vida de um membro da equipe vale mais do que todas as pessoas do mundo."
        }
      ]
    },
    {
      "titulo": "Filmes da marvel",
      "cor": "#e62429",
      "text":"Ordem correta de assisti os filmes da marvel",
      "videos": [
        {
          "titulo": "Capitão América: O Primeiro Vingador (2011)",
          "url": "https://www.youtube.com/watch?v=VyBS-UZVaNk",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Capitã Marvel (2019)",
          "url": "https://www.youtube.com/watch?v=4bMCzg-WBio",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Homem de Ferro (2008)",
          "url": "https://www.youtube.com/watch?v=8ugaeA-nMTc",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "O Incrível Hulk (2008)",
          "url": "https://www.youtube.com/watch?v=xbqNb2PFKKA",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Homem de Ferro 2 (2010)",
          "url": "https://www.youtube.com/watch?v=wKtcmiifycU",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Thor (2011)",
          "url": "https://www.youtube.com/watch?v=vJUDu40Z_RY",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Os Vingadores (2012)",
          "url": "https://www.youtube.com/watch?v=KeNEGtsCWEk",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Homem de Ferro 3 (2012)",
          "url": "https://www.youtube.com/watch?v=igfXmU1r_mc",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Thor: O Mundo Sombrio (2013)",
          "url": "https://www.youtube.com/watch?v=5sUfuOj7zOw",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Capitão América: O Soldado Invernal (2014)",
          "url": "https://www.youtube.com/watch?v=7SlILk2WMTI",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Vingadores: Era de Ultron (2015)",
          "url": "https://www.youtube.com/watch?v=Tg8hx9JKEZs",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Guardiões da Galáxia (2014)",
          "url": "https://www.youtube.com/watch?v=8VN_l57QWyQ",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Guardiões da Galáxia Vol. 2 (2017) ",
          "url": "https://www.youtube.com/watch?v=4-i8nTNSQFI",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Homem-Formiga (2015)",
          "url": "https://www.youtube.com/watch?v=jbbJ5WoLc1I",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Viúva Negra (2020)",
          "url": "https://www.youtube.com/watch?v=HmmrtZHgh6o",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Pantera Negra (2018)",
          "url": "https://www.youtube.com/watch?v=wL4a4MafSjQ",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Doutor Estranho (2016)",
          "url": "https://www.youtube.com/watch?v=HSzx-zryEgM",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Thor: Ragnarok (2017)",
          "url": "https://www.youtube.com/watch?v=ue80QwXMRHg",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Homem-Formiga e a Vespa (2018)",
          "url": "https://www.youtube.com/watch?v=J1cuts5Sm8g",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Vingadores: Guerra Infinita (2018)",
          "url": "https://www.youtube.com/watch?v=3BXq73F2_z4",
          "descricao":"oii eu sou a descrição"
        },
        {
          "titulo": "Vingadores Ultimato (2019)",
          "url": "https://www.youtube.com/watch?v=aZ-8GLLKImc",
          "descricao":"oii eu sou a descrição"
        }
      ]
    }   
  ]
}